In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
data = pd.read_csv("B:\Summer_Training_2024\Flight_Data.csv", low_memory = False)

In [4]:
data.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,date
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953,01-01-2018
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953,02-01-2018
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956,03-01-2018
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955,04-01-2018
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955,05-01-2018

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301206 entries, 0 to 301205
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Unnamed: 0        301206 non-null  int64
 1   airline           300754 non-null  object
 2   flight            301206 non-null  object
 3   source_city       301206 non-null  object
 4   departure_time    301206 non-null  object
 5   stops             301206 non-null  object
 6   arrival_time      301206 non-null  object
 7   destination_city  301206 non-null  object
 8   class             301006 non-null  object
 9   duration          300956 non-null  float64
 10  days_left         301206 non-null  int64
 11  price             301106 non-null  object
 12  date              358 non-null     object
dtypes: float64(1), int64(2), object(10)
memory usage: 29.9+ MB

In [6]:
data.isna().sum()

Unnamed: 0               0
airline                452
flight                   0
source_city              0
departure_time           0
stops                    0
arrival_time             0
destination_city         0
class                  200
duration               250
days_left                0
price                  100
date                300848
dtype: int64

In [9]:
data = data.dropna(subset = ['airline', 'class', 'price', 'duration'])

In [10]:
data.isna().sum()

Unnamed: 0               0
airline                  0
flight                   0
source_city              0
departure_time           0
stops                    0
arrival_time             0
destination_city         0
class                    0
duration                 0
days_left                0
price                    0
date                299846
dtype: int64

In [13]:
data.drop(['Unnamed: 0', 'date'], axis = 1, inplace = True)

In [14]:
data.head()

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [16]:
data['airline'].value_counts()

Vistara      127878
Air_India     80907
Indigo        43128
GO_FIRST      23176
AirAsia       16100
SpiceJet       9015
Name: airline, dtype: int64